blogs/jdb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-15 三 15:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>jdb debug java howto</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">jdb debug java howto</h1>
<p>
java的IDE很发达，很少有直接使用jdb的情况，并且jdb着实很不好用。但是呢？对不用IDE的小伙伴，掌握jdb还是必须的。
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 启用java的远程调试</h2>
<div class="outline-text-2" id="text-1">
<p>
启动java时，需要增加参数 <code>-Xdebug -agentlib:jdwp=transport=dt_socket,address=localhost:9999,server=y,suspend=n</code> ，开启远程调试，这里需要谨慎选择address，以免调试端口暴露在公网上，安全起见，可以选择localhost。
</p>

<p>
对于开发时，用maven启动的程序，可以通过设置 <code>MAVEN_OPTS</code> 环境变量的方式设置java启动参数。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 连接调试端口</h2>
<div class="outline-text-2" id="text-2">
<p>
jdb -attach localhost:9999
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">3</span> 常用的命令</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> help</h3>
<div class="outline-text-3" id="text-3-1">
<p>
不言而喻
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.2</span> 查看类，成员函数，成员变量</h3>
<div class="outline-text-3" id="text-3-2">
<p>
用来方便设置断点
</p>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">3.2.1</span> 查看所有的类</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
<code>classes</code> 可以查看已经加载的所有类
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">3.2.2</span> 查看类信息</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
<code>class &lt;class id&gt;</code> 查看类信息，包括父类，嵌套类
</p>
<pre class="example">
类: qiyun.model.Workflow
扩展: java.lang.Object
嵌套: qiyun.model.Workflow$NextCond
嵌套: qiyun.model.Workflow$OrgDuty
嵌套: qiyun.model.Workflow$SelectNext
嵌套: qiyun.model.Workflow$StartNode
嵌套: qiyun.model.Workflow$WorkNode
嵌套: qiyun.model.Workflow$Worksheet
</pre>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">3.2.3</span> 查看类的成员函数</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
<code>methods &lt;class id&gt;</code> 查看类的成员函数，包括继承的
</p>
<pre class="example">
qiyun.model.Workflow getWorkNode(long)
qiyun.model.Workflow getNextsDetail(java.util.List)
qiyun.model.Workflow getNexts(long)
java.lang.Object &lt;init&gt;()
java.lang.Object registerNatives()
java.lang.Object getClass()
java.lang.Object hashCode()
</pre>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">3.2.4</span> 查看类的成员变量</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
<code>fields &lt;class id&gt;</code> 查看类的成员变量
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.3</span> 断点相关</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>下面的&lt;class id&gt; 必须是完全限定名，不能只是类名，对于嵌套类，用$分隔</b>
</p>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">3.3.1</span> 在方法中设置断点</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
stop in &lt;class id&gt;.&lt;method&gt; 例如 <code>stop in example.WorkflowManager.worksheetNext</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">3.3.2</span> 在行中设置断点</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
stop at &lt;class id&gt;:&lt;line&gt; 例如 <code>stop at example.WorkflowManager:216</code>
</p>

<p>
需要注意，空行也可以成功设置断点，但是会报错，例如：无法设置断点example.WorkflowManager:215: example.WorkflowManager中的行 215 处没有代码。
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">3.3.3</span> 可能错误的断点设置</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
<code>stop in WorkflowManager.worksheetNext</code> 输出
</p>
<pre class="example">
正在延迟断点WorkflowManager.worksheetNext。
将在加载类后设置
</pre>

<p>
这里显示成功设置了断点，但是这个设置的是 <code>WorkflowManager</code> 的，不是 <code>example.WorkflowManager</code> 的，显然后者才是我们的目的。
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">3.3.4</span> 查看并删除断点</h4>
<div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li><code>clear</code> 查看所有断点</li>
<li><code>clear &lt;class id&gt;:&lt;line&gt;</code> 清除行中断点</li>
<li><code>clear &lt;class id&gt;.&lt;method&gt;</code> 清除方法中的断点</li>
</ul>

<p>
这个是stop的逆过程，比较好理解。
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.4</span> 查看堆栈信息</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>where</code>
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.5</span> 查看变量的值</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>locals 查看当前的所有本地变量</li>
<li>print  查看表达式的值</li>
<li>dump   查看对象的详细信息，例如各个字段的信息</li>
</ul>

<p>
请看下面的对比
</p>
<pre class="example">
qtp910889057-13[1] print approver
 approver = "example.Approver@7ad4e984"
qtp910889057-13[1] dump approver
 approver = {
    id: 11
    worksheetTitle: "星期三测试"
    employeeId: 31415946
    opinion: 3
    updatedAt: instance of java.time.LocalDateTime(id=8669)
}
qtp910889057-13[1] print employeeId
 employeeId = 31415946
</pre>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.6</span> 执行</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li><code>step up</code> 一直执行到方法返回</li>
<li><code>step</code> 单步执行</li>
<li><code>cont</code> 继续执行，只到下一个断点</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">4</span> 未完待续。。。</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-11-15 三 15:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
